{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/austinbean/Google Drive/Texas PUDF Zipped Backup Files/other_analyses/DiRienz//BPCI_analysis.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Apr 2021, 20:42:01
{txt}
{com}. 
. use "${c -(}datadir{c )-}DiRienz_data_all.dta", replace
{txt}
{com}. 
. 
. *merge with Area Resource File data
. rename county fips
{res}{txt}
{com}. merge m:1 fips using "${c -(}datadir{c )-}DiRienz_ahrf.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}       1,631,679
{txt}{col 9}from master{col 30}{res}       1,631,679{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}       2,641,396{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. save "${c -(}datadir{c )-}DiRienz_data_all.dta", replace
{txt}file /Users/austinbean/Google Drive/Texas PUDF Zipped Backup Files/other_analyses/DiRienz/DiRienz_data_all.dta saved

{com}. 
. *gen urban variable
. destring percenturban, generate(percenturban_x)
{txt}percenturban: all characters numeric; percenturban_x {res}generated {txt}as {res}double
{txt}(1631679 missing values generated)
{res}{txt}
{com}. drop percenturban
{txt}
{com}. rename percenturban_x percenturban
{res}{txt}
{com}. xtile urban = percenturban, nq(4)
{txt}
{com}. label variable percenturban "Percentage of patient's county that is urban"
{txt}
{com}. replace urban=. if percenturban==.
{txt}(0 real changes made)

{com}. 
. *gen median household income variable
. destring median_householdincome, replace force
{txt}median_householdincome: all characters numeric; {res}replaced {txt}as {res}long
{txt}(1631679 missing values generated)
{res}{txt}
{com}. xtile income = median_householdincome, nq(4)
{txt}
{com}. label variable median_householdincome "Median household income based on county"
{txt}
{com}. replace median_householdincome = median_householdincome/1000
{txt}variable {bf}median_householdincome{sf} was {bf}{res}long{sf}{txt} now {bf}{res}double{sf}
{txt}(2,641,396 real changes made)

{com}. 
. save "${c -(}datadir{c )-}DiRienz_data_all.dta", replace
{txt}file /Users/austinbean/Google Drive/Texas PUDF Zipped Backup Files/other_analyses/DiRienz/DiRienz_data_all.dta saved

{com}. 
. 
. **-----------------------------------------
. 
. 
. //**MERGE WITH ADDTL HOSPITAL DATA**//
. 
. *Merge to get discharges, number of beds, and govt control variables
. merge m:1 thcic_id using "${c -(}datadir{c )-}DiRienz_hosp.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}       3,916,336
{txt}{col 9}from master{col 30}{res}       3,916,336{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}         356,739{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. *gen bedsize var
. label variable beds "Number of hospital beds"
{txt}
{com}. gen bedsize=0
{txt}
{com}. replace bedsize=1 if inrange(beds, 1, 100)
{txt}(0 real changes made)

{com}. replace bedsize=2 if inrange(beds, 101, 200)
{txt}(151,220 real changes made)

{com}. replace bedsize=3 if beds>200
{txt}(4,121,855 real changes made)

{com}. label variable bedsize "Categorical var for number of beds"
{txt}
{com}. 
. *rename total discharges (annual)
. label variable totaldisc "Total annual discharges"
{txt}
{com}. 
. *gen hospital control  categorical var
. label variable control "Indicates control of hospital: profit, govt"
{txt}
{com}. gen hcontrl=0
{txt}
{com}. replace hcontrl=1 if control=="profit"
{txt}(351,817 real changes made)

{com}. replace hcontrl=2 if control=="gov"
{txt}(4,922 real changes made)

{com}. replace hcontrl=. if control==""
{txt}(3,916,336 real changes made, 3,916,336 to missing)

{com}. label variable hcontrl "Categorical variable for hospital control"
{txt}
{com}. 
. save "${c -(}datadir{c )-}DiRienz_data_all.dta", replace
{txt}file /Users/austinbean/Google Drive/Texas PUDF Zipped Backup Files/other_analyses/DiRienz/DiRienz_data_all.dta saved

{com}. 
. 
. 
. **-----------------------------------------
. 
. 
. //**CREATE IMPLEMENTATION GROUPS FOR did**//
. 
. *gen group of indicator variables to indicate policy start date
. *group1 = policy start date 10/1/2013 (just one instance)
. gen group1 = 0
{txt}
{com}. replace group1 = 1 if thcic_id==114001 & inlist(drg, 469, 470) 
{txt}(1,289 real changes made)

{com}. label variable group1 "BPCI enacted 10/1/2013"
{txt}
{com}. 
. *group2 = policy start date 4/1/2015
. gen group2 = 0
{txt}
{com}. replace group2 = 1 if thcic_id==114001 & ///
>  inlist(drg, 177, 178, 179, 193, 194, 195, 280, 281, 282, 190, 191, 192, 202, 203)
{txt}(4,840 real changes made)

{com}. replace group2 = 1 if thcic_id==349001 & ///
>  inlist(drg, 190, 191, 192, 202, 203, 480, 481, 482, 870, 871, 872, 537, 538, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 177, 178, 179, 193, 194, 195, 689, 690, 291, 292, 293, 246, 247, 248, 249, 250, 251, 273, 274, 602, 603)
{txt}(9,808 real changes made)

{com}. replace group2 = 1 if thcic_id==212000 & ///
>  inlist(drg, 190, 191, 192, 202, 203, 480, 481, 482, 870, 871, 872, 469, 470, 537, 538, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 177, 178, 179, 193, 194, 195, 186, 187, 188, 189, 204, 205, 206, 207, 208, 689, 690, 637, 638, 639, 291, 292, 293, 246, 247, 248, 249, 250, 251, 273, 274, 602, 603)
{txt}(22,098 real changes made)

{com}. replace group2 = 1 if thcic_id==336001 & ///
>  inlist(drg, 190, 191, 192, 202, 203, 870, 871, 872, 469, 470, 177, 178, 179, 193, 194, 195, 689, 690, 291, 292, 293)
{txt}(10,295 real changes made)

{com}. replace group2 = 1 if thcic_id==675000 & ///
>  inlist(drg, 61, 62, 63, 64, 65, 66, 329, 330, 331, 190, 191, 192, 202, 203, 870, 871, 872, 537, 538, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 177, 178, 179, 193, 194, 195, 689, 690, 682, 683, 684, 291, 292, 293, 602, 603)
{txt}(20,727 real changes made)

{com}. replace group2 = 1 if thcic_id==214000 & ///
>  inlist(drg, 61, 62, 63, 64, 65, 66, 190, 191, 192, 202, 203, 870, 871, 872, 469, 470, 537, 538, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 177, 178, 179, 193, 194, 195, 689, 690, 69, 291, 292, 293, 246, 247, 248, 249, 250, 251, 273, 274, 602, 603)
{txt}(16,383 real changes made)

{com}. replace group2 = 1 if thcic_id==340000 & ///
>  inlist(drg, 61, 62, 63, 64, 65, 66, 190, 191, 192, 202, 203, 469, 470, 177, 178, 179, 193, 194, 195, 291, 292, 293, 246, 247, 248, 249, 250, 251, 273, 274)
{txt}(11,231 real changes made)

{com}. replace group2 = 1 if thcic_id==477000 & ///
>  inlist(drg, 61, 62, 63, 64, 65, 66, 190, 191, 192, 202, 203, 870, 871, 872, 469, 470, 177, 178, 179, 193, 194, 195, 689, 690, 682, 683, 684, 291, 292, 293, 602, 603)
{txt}(16,101 real changes made)

{com}. label variable group2 "BPCI enacted 4/1/2015"
{txt}
{com}. 
. *group3 = policy start date 7/1/2015
. gen group3 = 0
{txt}
{com}. replace group3 = 1 if thcic_id==653001 & ///
>  inlist(drg, 280, 281, 282, 231, 232, 233, 234, 235, 236)
{txt}(4 real changes made)

{com}. replace group3 = 1 if thcic_id==124000 & inlist(drg, 469, 470)
{txt}(10,794 real changes made)

{com}. label variable group3 "BPCI enacted 7/1/2015"
{txt}
{com}. 
. *group4 = policy start date 10/1/2015
. gen group4 = 0
{txt}
{com}. replace group4 = 1 if thcic_id==349001 & ///
>  inlist(drg, 280, 281, 282, 637, 638, 639)
{txt}(1,010 real changes made)

{com}. replace group4 = 1 if thcic_id==212000 & ///
>  inlist(drg, 280, 281, 282, 308, 309, 310)
{txt}(3,208 real changes made)

{com}. replace group4 = 1 if thcic_id==336001 & ///
>  inlist(drg, 313, 61, 62, 63, 64, 65, 66)
{txt}(1,463 real changes made)

{com}. replace group4 = 1 if thcic_id==675000 & ///
>  inlist(drg, 280, 281, 282, 391, 392, 312) 
{txt}(3,330 real changes made)

{com}. replace group4 = 1 if thcic_id==214000 & ///
>  inlist(308, 309, 310, 388, 389, 390, 312)
{txt}(0 real changes made)

{com}. replace group4 = 1 if thcic_id==340000 & ///
>  inlist(drg, 689, 690)
{txt}(921 real changes made)

{com}. replace group4 = 1 if thcic_id==477000 & ///
>  inlist(471, 472, 473, 459, 460)
{txt}(0 real changes made)

{com}. label variable group4 "BPCI enacted 10/1/2015"
{txt}
{com}. 
. save "${c -(}datadir{c )-}DiRienz_data_all.dta", replace
{txt}file /Users/austinbean/Google Drive/Texas PUDF Zipped Backup Files/other_analyses/DiRienz/DiRienz_data_all.dta saved

{com}. 
. 
. **-----------------------------------------
. 
. 
. //**CREATE VARIABLES FOR EVENT STUDY & did**//
. 
. egen time = group(year dqtr)
{txt}
{com}. gen post=1 if group1==1 & time>15
{txt}(4,272,440 missing values generated)

{com}. replace post=1 if group2==1 & time>21
{txt}(52,258 real changes made)

{com}. replace post=1 if group3==1 & time>22
{txt}(4,567 real changes made)

{com}. replace post=1 if group4==1 & time>23
{txt}(4,013 real changes made)

{com}. 
. save "${c -(}datadir{c )-}DiRienz_data_all.dta", replace
{txt}file /Users/austinbean/Google Drive/Texas PUDF Zipped Backup Files/other_analyses/DiRienz/DiRienz_data_all.dta saved

{com}. 
. **-----------------------------------------
. 
. **SAVE SUBSAMPLE FOR AIM2**
. keep if medicare==1
{txt}(1,355,970 observations deleted)

{com}. keep if bpci_drg==1
{txt}(0 observations deleted)

{com}. *interaction var
. gen did=post*bpci
{txt}(2,873,446 missing values generated)

{com}. label variable did "Interaction variable that indicates 1 if under BPCI contract and occurred after implementation"
{txt}note: label truncated to 80 characters

{com}. 
. save "${c -(}datadir{c )-}DiRienz_AIM2.dta"
{txt}file /Users/austinbean/Google Drive/Texas PUDF Zipped Backup Files/other_analyses/DiRienz/DiRienz_AIM2.dta saved

{com}. clear
{txt}
{com}. 
. **SAVE SUBSAMPLE FOR AIM1**
. use "${c -(}datadir{c )-}DiRienz_data_all.dta"
{txt}
{com}. keep if bpci==1
{txt}(4,134,002 observations deleted)

{com}. *interaction var
. gen did=post*medicare
{txt}(77,600 missing values generated)

{com}. label variable did "Interaction variable that indicates 1 if under BPCI contract and occurred after implementation"
{txt}note: label truncated to 80 characters

{com}. 
. save "${c -(}datadir{c )-}DiRienz_AIM1.dta"
{txt}file /Users/austinbean/Google Drive/Texas PUDF Zipped Backup Files/other_analyses/DiRienz/DiRienz_AIM1.dta saved

{com}. 
. **-----------------------------------------
. 
. 
. //**AIM 1 RESULTS**//
. //SAMPLE = BPCI HOSPITALS (treatment = MEDICARE)
. 
. **TABLES** (assorted, won't be using all but good info to have)
. 
. table year medicare, c(mean totchg_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |}        {res}0         0
     {txt}2010 {c |} {res}90995.83   88707.8
     {txt}2011 {c |} {res}89099.35  91304.13
     {txt}2012 {c |} {res}91990.33  91832.66
     {txt}2013 {c |} {res}92235.42  96310.49
     {txt}2014 {c |} {res}89339.96  95418.61
     {txt}2015 {c |} {res}93299.88  98390.72
     {txt}2016 {c |} {res}96509.88  102229.7
     {txt}2017 {c |} {res}97501.55  105433.7
     {txt}2018 {c |}        {res}0         0
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare, c(mean los_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |}  {res}4.22449  4.875342
     {txt}2010 {c |} {res}4.111516  5.114615
     {txt}2011 {c |} {res}3.963438  5.152964
     {txt}2012 {c |} {res}3.923805  5.069235
     {txt}2013 {c |} {res}3.990609  5.222955
     {txt}2014 {c |} {res}4.226103  5.417676
     {txt}2015 {c |} {res}4.250502  5.579911
     {txt}2016 {c |} {res}4.286715  5.609796
     {txt}2017 {c |}  {res}4.14178  5.388131
     {txt}2018 {c |} {res}4.213511  5.275734
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare, c(mean postcare)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |} {res}.4234694  .5246575
     {txt}2010 {c |} {res}.3001067  .5134023
     {txt}2011 {c |} {res}.2810265  .5178553
     {txt}2012 {c |} {res}.2712559  .4862749
     {txt}2013 {c |} {res}.2572305  .4837058
     {txt}2014 {c |} {res}.2016185  .4448658
     {txt}2015 {c |} {res}.1809781  .4188394
     {txt}2016 {c |} {res}.1997029  .4481858
     {txt}2017 {c |} {res}.2030964  .4882577
     {txt}2018 {c |} {res}.2379066  .5088456
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare, c(sum age3)

{txt}{hline 10}{c TT}{hline 11}
          {c |}  Primary  
          {c |}  expected 
          {c |}  payer is 
Discharge {c |}  medicare 
year      {c |}    0     1
{hline 10}{c +}{hline 11}
     2009 {c |}  {res}588     0
     {txt}2010 {c |} {res}4685     0
     {txt}2011 {c |} {res}4759     0
     {txt}2012 {c |} {res}4646     0
     {txt}2013 {c |} {res}4579     0
     {txt}2014 {c |} {res}4352     0
     {txt}2015 {c |} {res}4479     0
     {txt}2016 {c |} {res}4712     0
     {txt}2017 {c |} {res}4909     0
     {txt}2018 {c |} {res}4796     0
{txt}{hline 10}{c BT}{hline 11}

{com}. tabstat totchg_r totchg_w totchg_rlog, by(year) stat(mean sem)

{txt}Summary statistics: mean, se(mean)
  by categories of: year (Discharge year)

{ralign 6:year} {...}
{c |}{...}
  totchg_r  totchg_w  totchg~g
{hline 7}{c +}{hline 30}
{ralign 6:2009} {...}
{c |}{...}
 {res}        0         0         .
{txt}{space 6} {...}
{c |}{...}
 {res}        0         0         .
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2010} {...}
{c |}{...}
 {res} 90675.43  89520.43  11.16825
{txt}{space 6} {...}
{c |}{...}
 {res} 617.4505  552.5449   .006251
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2011} {...}
{c |}{...}
 {res} 91995.98  90577.55  11.17283
{txt}{space 6} {...}
{c |}{...}
 {res} 636.5427  552.1473  .0060155
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2012} {...}
{c |}{...}
 {res} 93159.96  91880.65  11.18139
{txt}{space 6} {...}
{c |}{...}
 {res} 611.2826  544.4684  .0059537
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2013} {...}
{c |}{...}
 {res} 97305.63  95094.72   11.2167
{txt}{space 6} {...}
{c |}{...}
 {res} 753.6105  579.4974  .0059118
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2014} {...}
{c |}{...}
 {res} 95980.85   93625.1  11.20122
{txt}{space 6} {...}
{c |}{...}
 {res} 736.0933  600.5741  .0059433
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2015} {...}
{c |}{...}
 {res}  99072.5  96899.52  11.23793
{txt}{space 6} {...}
{c |}{...}
 {res} 717.9684  612.6196  .0057667
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2016} {...}
{c |}{...}
 {res} 102921.4  100525.9  11.27639
{txt}{space 6} {...}
{c |}{...}
 {res} 750.1433  616.4153  .0057015
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2017} {...}
{c |}{...}
 {res} 105062.4  103102.6  11.28571
{txt}{space 6} {...}
{c |}{...}
 {res} 699.1895  613.3802  .0060776
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2018} {...}
{c |}{...}
 {res}        0         0         .
{txt}{space 6} {...}
{c |}{...}
 {res}        0         0         .
{txt}{hline 7}{c +}{hline 30}
{ralign 6:Total} {...}
{c |}{...}
 {res} 84513.73  82875.88  11.21986
{txt}{space 6} {...}
{c |}{...}
 {res} 231.9149  200.5631  .0021097
{txt}{hline 7}{c BT}{hline 30}

{com}. tabstat los_r los_w los_rlog, by(year) stat(mean sem)

{txt}Summary statistics: mean, se(mean)
  by categories of: year (Discharge year)

{ralign 6:year} {...}
{c |}{...}
     los_r     los_w  los_rlog
{hline 7}{c +}{hline 30}
{ralign 6:2009} {...}
{c |}{...}
 {res}  4.66692  4.584977  1.276649
{txt}{space 6} {...}
{c |}{...}
 {res} .1400966  .1034543  .0192369
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2010} {...}
{c |}{...}
 {res} 4.769628   4.75877  1.303938
{txt}{space 6} {...}
{c |}{...}
 {res}  .035365  .0344725   .006191
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2011} {...}
{c |}{...}
 {res} 4.773007  4.760958  1.289532
{txt}{space 6} {...}
{c |}{...}
 {res}   .03444  .0332757  .0061086
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2012} {...}
{c |}{...}
 {res} 4.727297  4.720548  1.279778
{txt}{space 6} {...}
{c |}{...}
 {res} .0328548  .0322337  .0059388
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2013} {...}
{c |}{...}
 {res} 4.885327  4.855291  1.295758
{txt}{space 6} {...}
{c |}{...}
 {res} .0406175  .0342663  .0060139
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2014} {...}
{c |}{...}
 {res} 5.089356  5.066102  1.318081
{txt}{space 6} {...}
{c |}{...}
 {res} .0387591  .0369503  .0064078
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2015} {...}
{c |}{...}
 {res} 5.218037  5.190504  1.324305
{txt}{space 6} {...}
{c |}{...}
 {res} .0399704  .0378374  .0065194
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2016} {...}
{c |}{...}
 {res} 5.254251   5.21569  1.309867
{txt}{space 6} {...}
{c |}{...}
 {res} .0445228  .0377232  .0066542
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2017} {...}
{c |}{...}
 {res}  5.03999  5.021851  1.269479
{txt}{space 6} {...}
{c |}{...}
 {res} .0368601  .0356381  .0064691
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2018} {...}
{c |}{...}
 {res} 4.990206  4.975161  1.274119
{txt}{space 6} {...}
{c |}{...}
 {res}   .03505  .0339582  .0063213
{txt}{hline 7}{c +}{hline 30}
{ralign 6:Total} {...}
{c |}{...}
 {res} 4.974851  4.953845  1.295269
{txt}{space 6} {...}
{c |}{...}
 {res} .0126035  .0117114  .0020962
{txt}{hline 7}{c BT}{hline 30}

{com}. tabstat teach snf_ rehab_ ltc_, by(year) stat(count mean sem)

{txt}Summary statistics: N, mean, se(mean)
  by categories of: year (Discharge year)

{ralign 6:year} {...}
{c |}{...}
     teach      snf_    rehab_      ltc_
{hline 7}{c +}{hline 40}
{ralign 6:2009} {...}
{c |}{...}
 {res}     1318      1318      1318      1318
{txt}{space 6} {...}
{c |}{...}
 {res}  .383915         0   .176783         0
{txt}{space 6} {...}
{c |}{...}
 {res} .0134012         0   .010512         0
{txt}{hline 7}{c +}{hline 40}
{ralign 6:2010} {...}
{c |}{...}
 {res}    13191     13191     13191     13191
{txt}{space 6} {...}
{c |}{...}
 {res} .2562353  .2230309   .536957         0
{txt}{space 6} {...}
{c |}{...}
 {res} .0038011  .0036246  .0043417         0
{txt}{hline 7}{c +}{hline 40}
{ralign 6:2011} {...}
{c |}{...}
 {res}    14441     14441     14441     14441
{txt}{space 6} {...}
{c |}{...}
 {res} .2602313   .234679  .5905408  .0358008
{txt}{space 6} {...}
{c |}{...}
 {res} .0036513  .0035268  .0040921  .0015461
{txt}{hline 7}{c +}{hline 40}
{ralign 6:2012} {...}
{c |}{...}
 {res}    15262     15262     15262     15262
{txt}{space 6} {...}
{c |}{...}
 {res} .3697418  .2291312   .482309    .07214
{txt}{space 6} {...}
{c |}{...}
 {res} .0039077  .0034021  .0040449  .0020943
{txt}{hline 7}{c +}{hline 40}
{ralign 6:2013} {...}
{c |}{...}
 {res}    15348     15348     15348     15348
{txt}{space 6} {...}
{c |}{...}
 {res} .3524238  .1576101  .4658587  .0719312
{txt}{space 6} {...}
{c |}{...}
 {res} .0038563  .0029413  .0040266  .0020856
{txt}{hline 7}{c +}{hline 40}
{ralign 6:2014} {...}
{c |}{...}
 {res}    14750     14750     14750     14750
{txt}{space 6} {...}
{c |}{...}
 {res} .3257627   .080678  .4789831   .076678
{txt}{space 6} {...}
{c |}{...}
 {res}  .003859  .0022425  .0041134  .0021909
{txt}{hline 7}{c +}{hline 40}
{ralign 6:2015} {...}
{c |}{...}
 {res}    15291     15291     15291     15291
{txt}{space 6} {...}
{c |}{...}
 {res}  .323916  .0800471  .4964358   .039762
{txt}{space 6} {...}
{c |}{...}
 {res} .0037845  .0021946  .0040435  .0015802
{txt}{hline 7}{c +}{hline 40}
{ralign 6:2016} {...}
{c |}{...}
 {res}    15819     15819     15819     15819
{txt}{space 6} {...}
{c |}{...}
 {res} .3223339  .0762374  .4979455         0
{txt}{space 6} {...}
{c |}{...}
 {res} .0037161    .00211  .0039755         0
{txt}{hline 7}{c +}{hline 40}
{ralign 6:2017} {...}
{c |}{...}
 {res}    16704     16704     16704     16704
{txt}{space 6} {...}
{c |}{...}
 {res} .3375838  .1002754  .5117936         0
{txt}{space 6} {...}
{c |}{...}
 {res}  .003659  .0023241  .0038677         0
{txt}{hline 7}{c +}{hline 40}
{ralign 6:2018} {...}
{c |}{...}
 {res}    16949     16949     16949     16949
{txt}{space 6} {...}
{c |}{...}
 {res} .2975397  .0437194  .4712962         0
{txt}{space 6} {...}
{c |}{...}
 {res} .0035118  .0015706  .0038344         0
{txt}{hline 7}{c +}{hline 40}
{ralign 6:Total} {...}
{c |}{...}
 {res}   139073    139073    139073    139073
{txt}{space 6} {...}
{c |}{...}
 {res} .3180704  .1314633  .4991983  .0320767
{txt}{space 6} {...}
{c |}{...}
 {res} .0012489  .0009061  .0013408  .0004725
{txt}{hline 7}{c BT}{hline 40}

{com}. tabstat totchg_w los_w postcare female highsev dual icu racecat percenturban median_householdincome bedsize hcontrl teach snf_ rehab_ ltc_ totaldisc, stat(mean sd min max) col(stat)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd       min       max
{hline 13}{c +}{hline 40}
{ralign 12:totchg_w} {...}
{c |}{...}
 {res} 82875.88  74794.97         0  436555.9
{txt}{ralign 12:los_w} {...}
{c |}{...}
 {res} 4.953845  4.367159         1        38
{txt}{ralign 12:postcare} {...}
{c |}{...}
 {res} .4056547  .4910201         0         1
{txt}{ralign 12:female} {...}
{c |}{...}
 {res} .5700531    .49507         0         1
{txt}{ralign 12:highsev} {...}
{c |}{...}
 {res} .4263516   .494548         0         1
{txt}{ralign 12:dual} {...}
{c |}{...}
 {res}  .099286  .2990467         0         1
{txt}{ralign 12:icu} {...}
{c |}{...}
 {res} .3747672  .4840645         0         1
{txt}{ralign 12:racecat} {...}
{c |}{...}
 {res} 1.417896  .7490154         1         3
{txt}{ralign 12:percenturban} {...}
{c |}{...}
 {res} 87.14312  20.41413         0      99.3
{txt}{ralign 12:median_hou~e} {...}
{c |}{...}
 {res}  64.5472  12.71671    24.794    93.645
{txt}{ralign 12:bedsize} {...}
{c |}{...}
 {res} 2.825415  .3796127         2         3
{txt}{ralign 12:hcontrl} {...}
{c |}{...}
 {res} 1.000029   .005363         1         2
{txt}{ralign 12:teach} {...}
{c |}{...}
 {res} .3180704  .4657286         0         1
{txt}{ralign 12:snf_} {...}
{c |}{...}
 {res} .1314633  .3379076         0         1
{txt}{ralign 12:rehab_} {...}
{c |}{...}
 {res} .4991983  .5000012         0         1
{txt}{ralign 12:ltc_} {...}
{c |}{...}
 {res} .0320767  .1762044         0         1
{txt}{ralign 12:totaldisc} {...}
{c |}{...}
 {res} 22178.86  12710.78      2749     58575
{txt}{hline 13}{c BT}{hline 40}

{com}. tabstat los_w totchg_w postcare, by(year) stat(mean sem min max)

{txt}Summary statistics: mean, se(mean), min, max
  by categories of: year (Discharge year)

{ralign 6:year} {...}
{c |}{...}
     los_w  totchg_w  postcare
{hline 7}{c +}{hline 30}
{ralign 6:2009} {...}
{c |}{...}
 {res} 4.584977         0  .4795144
{txt}{space 6} {...}
{c |}{...}
 {res} .1034543         0  .0137661
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       29         0         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2010} {...}
{c |}{...}
 {res}  4.75877  89520.43  .4376469
{txt}{space 6} {...}
{c |}{...}
 {res} .0344725  552.5449  .0043196
{txt}{space 6} {...}
{c |}{...}
 {res}        1   164.105         0
{txt}{space 6} {...}
{c |}{...}
 {res}       36  384756.3         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2011} {...}
{c |}{...}
 {res} 4.760958  90577.55  .4397503
{txt}{space 6} {...}
{c |}{...}
 {res} .0332757  552.1473  .0041343
{txt}{space 6} {...}
{c |}{...}
 {res}        1  1029.057         0
{txt}{space 6} {...}
{c |}{...}
 {res}       38  389166.7         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2012} {...}
{c |}{...}
 {res} 4.720548  91880.65   .420873
{txt}{space 6} {...}
{c |}{...}
 {res} .0322337  544.4684      .004
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       38  394804.5         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2013} {...}
{c |}{...}
 {res} 4.855291  95094.72  .4161657
{txt}{space 6} {...}
{c |}{...}
 {res} .0342663  579.4974  .0039846
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       35  409021.1         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2014} {...}
{c |}{...}
 {res} 5.066102   93625.1  .3728524
{txt}{space 6} {...}
{c |}{...}
 {res} .0369503  600.5741  .0040009
{txt}{space 6} {...}
{c |}{...}
 {res}        1  1313.272         0
{txt}{space 6} {...}
{c |}{...}
 {res}       36  416792.6         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2015} {...}
{c |}{...}
 {res} 5.190504  96899.52  .3491214
{txt}{space 6} {...}
{c |}{...}
 {res} .0378374  612.6196  .0038745
{txt}{space 6} {...}
{c |}{...}
 {res}        1  3376.446         0
{txt}{space 6} {...}
{c |}{...}
 {res}       35  436555.9         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2016} {...}
{c |}{...}
 {res}  5.21569  100525.9  .3741703
{txt}{space 6} {...}
{c |}{...}
 {res} .0377232  616.4153  .0038476
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       35  432732.2         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2017} {...}
{c |}{...}
 {res} 5.021851  103102.6   .404454
{txt}{space 6} {...}
{c |}{...}
 {res} .0356381  613.3802  .0037975
{txt}{space 6} {...}
{c |}{...}
 {res}        1     10.42         0
{txt}{space 6} {...}
{c |}{...}
 {res}       34  436268.4         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2018} {...}
{c |}{...}
 {res} 4.975161         0  .4321789
{txt}{space 6} {...}
{c |}{...}
 {res} .0339582         0  .0038052
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       34         0         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:Total} {...}
{c |}{...}
 {res} 4.953845  82875.88  .4056547
{txt}{space 6} {...}
{c |}{...}
 {res} .0117114  200.5631  .0013185
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       38  436555.9         1
{txt}{hline 7}{c BT}{hline 30}

{com}. tabstat los_w totchg_w postcare, by(year) stat(mean sem min max)

{txt}Summary statistics: mean, se(mean), min, max
  by categories of: year (Discharge year)

{ralign 6:year} {...}
{c |}{...}
     los_w  totchg_w  postcare
{hline 7}{c +}{hline 30}
{ralign 6:2009} {...}
{c |}{...}
 {res} 4.584977         0  .4795144
{txt}{space 6} {...}
{c |}{...}
 {res} .1034543         0  .0137661
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       29         0         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2010} {...}
{c |}{...}
 {res}  4.75877  89520.43  .4376469
{txt}{space 6} {...}
{c |}{...}
 {res} .0344725  552.5449  .0043196
{txt}{space 6} {...}
{c |}{...}
 {res}        1   164.105         0
{txt}{space 6} {...}
{c |}{...}
 {res}       36  384756.3         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2011} {...}
{c |}{...}
 {res} 4.760958  90577.55  .4397503
{txt}{space 6} {...}
{c |}{...}
 {res} .0332757  552.1473  .0041343
{txt}{space 6} {...}
{c |}{...}
 {res}        1  1029.057         0
{txt}{space 6} {...}
{c |}{...}
 {res}       38  389166.7         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2012} {...}
{c |}{...}
 {res} 4.720548  91880.65   .420873
{txt}{space 6} {...}
{c |}{...}
 {res} .0322337  544.4684      .004
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       38  394804.5         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2013} {...}
{c |}{...}
 {res} 4.855291  95094.72  .4161657
{txt}{space 6} {...}
{c |}{...}
 {res} .0342663  579.4974  .0039846
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       35  409021.1         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2014} {...}
{c |}{...}
 {res} 5.066102   93625.1  .3728524
{txt}{space 6} {...}
{c |}{...}
 {res} .0369503  600.5741  .0040009
{txt}{space 6} {...}
{c |}{...}
 {res}        1  1313.272         0
{txt}{space 6} {...}
{c |}{...}
 {res}       36  416792.6         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2015} {...}
{c |}{...}
 {res} 5.190504  96899.52  .3491214
{txt}{space 6} {...}
{c |}{...}
 {res} .0378374  612.6196  .0038745
{txt}{space 6} {...}
{c |}{...}
 {res}        1  3376.446         0
{txt}{space 6} {...}
{c |}{...}
 {res}       35  436555.9         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2016} {...}
{c |}{...}
 {res}  5.21569  100525.9  .3741703
{txt}{space 6} {...}
{c |}{...}
 {res} .0377232  616.4153  .0038476
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       35  432732.2         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2017} {...}
{c |}{...}
 {res} 5.021851  103102.6   .404454
{txt}{space 6} {...}
{c |}{...}
 {res} .0356381  613.3802  .0037975
{txt}{space 6} {...}
{c |}{...}
 {res}        1     10.42         0
{txt}{space 6} {...}
{c |}{...}
 {res}       34  436268.4         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:2018} {...}
{c |}{...}
 {res} 4.975161         0  .4321789
{txt}{space 6} {...}
{c |}{...}
 {res} .0339582         0  .0038052
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       34         0         1
{txt}{hline 7}{c +}{hline 30}
{ralign 6:Total} {...}
{c |}{...}
 {res} 4.953845  82875.88  .4056547
{txt}{space 6} {...}
{c |}{...}
 {res} .0117114  200.5631  .0013185
{txt}{space 6} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 6} {...}
{c |}{...}
 {res}       38  436555.9         1
{txt}{hline 7}{c BT}{hline 30}

{com}. tabstat los_w totchg_w postcare, by(medicare) stat(mean sem min max)

{txt}Summary statistics: mean, se(mean), min, max
  by categories of: medicare (Primary expected payer is medicare)

{ralign 8:medicare} {...}
{c |}{...}
     los_w  totchg_w  postcare
{hline 9}{c +}{hline 30}
{ralign 8:0} {...}
{c |}{...}
 {res} 4.123764  80935.41  .2399774
{txt}{space 8} {...}
{c |}{...}
 {res} .0191759  349.4975   .002074
{txt}{space 8} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}       36  436555.9         1
{txt}{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} 5.319128  83729.98  .4786244
{txt}{space 8} {...}
{c |}{...}
 {res} .0144466  244.4195  .0016099
{txt}{space 8} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}       38  436555.9         1
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} 4.953845  82875.88  .4056547
{txt}{space 8} {...}
{c |}{...}
 {res} .0117114  200.5631  .0013185
{txt}{space 8} {...}
{c |}{...}
 {res}        1         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}       38  436555.9         1
{txt}{hline 9}{c BT}{hline 30}

{com}. 
. tabstat record_id, by(year) stat(count)

{txt}Summary for variables: record_id
{col 6}by categories of: year (Discharge year)

{ralign 6:year} {...}
{c |}         N
{hline 7}{c +}{hline 10}
{ralign 6:2009} {...}
{c |}{...}
 {res}     1318
{txt}{ralign 6:2010} {...}
{c |}{...}
 {res}    13191
{txt}{ralign 6:2011} {...}
{c |}{...}
 {res}    14441
{txt}{ralign 6:2012} {...}
{c |}{...}
 {res}    15262
{txt}{ralign 6:2013} {...}
{c |}{...}
 {res}    15348
{txt}{ralign 6:2014} {...}
{c |}{...}
 {res}    14750
{txt}{ralign 6:2015} {...}
{c |}{...}
 {res}    15291
{txt}{ralign 6:2016} {...}
{c |}{...}
 {res}    15819
{txt}{ralign 6:2017} {...}
{c |}{...}
 {res}    16704
{txt}{ralign 6:2018} {...}
{c |}{...}
 {res}    16949
{txt}{hline 7}{c +}{hline 10}
{ralign 6:Total} {...}
{c |}{...}
 {res}   139073
{txt}{hline 7}{c BT}{hline 10}

{com}. bysort year : inspect thcic_id

{txt}{hline}
-> year = 2009

{res}thcic_id:  THCIC_ID                             {txt}Number of Observations
{hline 19}                    {hline 39}
                                             Total      Integers   Nonintegers
{c |}      {res}#                     {txt}Negative            {res}-             -             -
{txt}{c |}      {res}#       #             {txt}Zero                {res}-             -             -
{txt}{c |}      {res}#       #             {txt}Positive  {res}      1,318         1,318             -
{txt}{c |}  {res}#   #       #                       {txt}{hline 11}   {hline 11}   {hline 11}
{c |}  {res}#   #       #             {txt}Total     {res}      1,318         1,318             -
{txt}{c |}  {res}#   #   .   #             {txt}Missing             {res}-
{txt}{c +}{hline 22}{col 40}{hline 11}
{res}214000           477000                      1,318
   (4 unique values)

{txt}{hline}
-> year = 2010

{res}thcic_id:  THCIC_ID                             {txt}Number of Observations
{hline 19}                    {hline 39}
                                             Total      Integers   Nonintegers
{c |}  {res}#                         {txt}Negative            {res}-             -             -
{txt}{c |}  {res}#                         {txt}Zero                {res}-             -             -
{txt}{c |}  {res}#                         {txt}Positive  {res}     13,191        13,191             -
{txt}{c |}  {res}#                                   {txt}{hline 11}   {hline 11}   {hline 11}
{c |}  {res}#       #   #             {txt}Total     {res}     13,191        13,191             -
{txt}{c |}  {res}#   .   #   #   #         {txt}Missing             {res}-
{txt}{c +}{hline 22}{col 40}{hline 11}
{res}114001           675000                     13,191
  (11 unique values)

{txt}{hline}
-> year = 2011

{res}thcic_id:  THCIC_ID                             {txt}Number of Observations
{hline 19}                    {hline 39}
                                             Total      Integers   Nonintegers
{c |}  {res}#                         {txt}Negative            {res}-             -             -
{txt}{c |}  {res}#                         {txt}Zero                {res}-             -             -
{txt}{c |}  {res}#                         {txt}Positive  {res}     14,441        14,441             -
{txt}{c |}  {res}#                                   {txt}{hline 11}   {hline 11}   {hline 11}
{c |}  {res}#       #   #   #         {txt}Total     {res}     14,441        14,441             -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing             {res}-
{txt}{c +}{hline 22}{col 40}{hline 11}
{res}114001           675000                     14,441
  (10 unique values)

{txt}{hline}
-> year = 2012

{res}thcic_id:  THCIC_ID                             {txt}Number of Observations
{hline 19}                    {hline 39}
                                             Total      Integers   Nonintegers
{c |}  {res}#                         {txt}Negative            {res}-             -             -
{txt}{c |}  {res}#                         {txt}Zero                {res}-             -             -
{txt}{c |}  {res}#                         {txt}Positive  {res}     15,262        15,262             -
{txt}{c |}  {res}#                                   {txt}{hline 11}   {hline 11}   {hline 11}
{c |}  {res}#       #   #   #         {txt}Total     {res}     15,262        15,262             -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing             {res}-
{txt}{c +}{hline 22}{col 40}{hline 11}
{res}114001           675000                     15,262
  (10 unique values)

{txt}{hline}
-> year = 2013

{res}thcic_id:  THCIC_ID                             {txt}Number of Observations
{hline 19}                    {hline 39}
                                             Total      Integers   Nonintegers
{c |}  {res}#                         {txt}Negative            {res}-             -             -
{txt}{c |}  {res}#                         {txt}Zero                {res}-             -             -
{txt}{c |}  {res}#                         {txt}Positive  {res}     15,348        15,348             -
{txt}{c |}  {res}#                                   {txt}{hline 11}   {hline 11}   {hline 11}
{c |}  {res}#       #       #         {txt}Total     {res}     15,348        15,348             -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing             {res}-
{txt}{c +}{hline 22}{col 40}{hline 11}
{res}114001           675000                     15,348
  (10 unique values)

{txt}{hline}
-> year = 2014

{res}thcic_id:  THCIC_ID                             {txt}Number of Observations
{hline 19}                    {hline 39}
                                             Total      Integers   Nonintegers
{c |}  {res}#                         {txt}Negative            {res}-             -             -
{txt}{c |}  {res}#                         {txt}Zero                {res}-             -             -
{txt}{c |}  {res}#                         {txt}Positive  {res}     14,750        14,750             -
{txt}{c |}  {res}#                                   {txt}{hline 11}   {hline 11}   {hline 11}
{c |}  {res}#       #       #         {txt}Total     {res}     14,750        14,750             -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing             {res}-
{txt}{c +}{hline 22}{col 40}{hline 11}
{res}114001           675000                     14,750
  (10 unique values)

{txt}{hline}
-> year = 2015

{res}thcic_id:  THCIC_ID                             {txt}Number of Observations
{hline 19}                    {hline 39}
                                             Total      Integers   Nonintegers
{c |}  {res}#                         {txt}Negative            {res}-             -             -
{txt}{c |}  {res}#                         {txt}Zero                {res}-             -             -
{txt}{c |}  {res}#                         {txt}Positive  {res}     15,291        15,291             -
{txt}{c |}  {res}#                                   {txt}{hline 11}   {hline 11}   {hline 11}
{c |}  {res}#       #       #         {txt}Total     {res}     15,291        15,291             -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing             {res}-
{txt}{c +}{hline 22}{col 40}{hline 11}
{res}114001           675000                     15,291
  (10 unique values)

{txt}{hline}
-> year = 2016

{res}thcic_id:  THCIC_ID                             {txt}Number of Observations
{hline 19}                    {hline 39}
                                             Total      Integers   Nonintegers
{c |}  {res}#                         {txt}Negative            {res}-             -             -
{txt}{c |}  {res}#                         {txt}Zero                {res}-             -             -
{txt}{c |}  {res}#                         {txt}Positive  {res}     15,819        15,819             -
{txt}{c |}  {res}#                                   {txt}{hline 11}   {hline 11}   {hline 11}
{c |}  {res}#       #       #         {txt}Total     {res}     15,819        15,819             -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing             {res}-
{txt}{c +}{hline 22}{col 40}{hline 11}
{res}114001           675000                     15,819
  (11 unique values)

{txt}{hline}
-> year = 2017

{res}thcic_id:  THCIC_ID                             {txt}Number of Observations
{hline 19}                    {hline 39}
                                             Total      Integers   Nonintegers
{c |}  {res}#                         {txt}Negative            {res}-             -             -
{txt}{c |}  {res}#                         {txt}Zero                {res}-             -             -
{txt}{c |}  {res}#                         {txt}Positive  {res}     16,704        16,704             -
{txt}{c |}  {res}#                                   {txt}{hline 11}   {hline 11}   {hline 11}
{c |}  {res}#       #       #         {txt}Total     {res}     16,704        16,704             -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing             {res}-
{txt}{c +}{hline 22}{col 40}{hline 11}
{res}114001           675000                     16,704
  (11 unique values)

{txt}{hline}
-> year = 2018

{res}thcic_id:  THCIC_ID                             {txt}Number of Observations
{hline 19}                    {hline 39}
                                             Total      Integers   Nonintegers
{c |}  {res}#                         {txt}Negative            {res}-             -             -
{txt}{c |}  {res}#                         {txt}Zero                {res}-             -             -
{txt}{c |}  {res}#                         {txt}Positive  {res}     16,949        16,949             -
{txt}{c |}  {res}#                                   {txt}{hline 11}   {hline 11}   {hline 11}
{c |}  {res}#       #       #         {txt}Total     {res}     16,949        16,949             -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing             {res}-
{txt}{c +}{hline 22}{col 40}{hline 11}
{res}114001           675000                     16,949
  (10 unique values)

{txt}
{com}. display r(N_unique)
{res}10
{txt}
{com}. 
. tab ethnicity, m

  {txt}Indicates {c |}
   hispanic {c |}
 origin (1) {c |}
  or not of {c |}
   hispanic {c |}
 origin (2) {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,784        1.28        1.28
{txt}          2 {c |}{res}     12,711        9.14       10.42
{txt}          . {c |}{res}    124,578       89.58      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    139,073      100.00
{txt}
{com}. tab racecat, m

  {txt}Indicates {c |}
race: white {c |}
  (1) black {c |}
     (2) or {c |}
  other (3) {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}    103,051       74.10       74.10
{txt}          2 {c |}{res}     13,926       10.01       84.11
{txt}          3 {c |}{res}     22,096       15.89      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    139,073      100.00
{txt}
{com}. table year racecat, c(mean totchg_w)

{txt}{hline 10}{c TT}{hline 29}
          {c |}  Indicates race: white (1)  
Discharge {c |}    black (2) or other (3)   
year      {c |}        1         2         3
{hline 10}{c +}{hline 29}
     2009 {c |}        {res}0         0         0
     {txt}2010 {c |} {res}91602.09  87963.43  80664.81
     {txt}2011 {c |} {res}93345.49  85467.48  80823.28
     {txt}2012 {c |} {res}93732.14  88816.01  84961.33
     {txt}2013 {c |} {res}97725.38  91390.85  85246.91
     {txt}2014 {c |} {res}94844.05  94233.84  87843.22
     {txt}2015 {c |} {res}98464.82  95465.88  91087.01
     {txt}2016 {c |} {res}101998.1  98127.61  95171.41
     {txt}2017 {c |} {res}104333.1  99994.99   99358.1
     {txt}2018 {c |}        {res}0         0         0
{txt}{hline 10}{c BT}{hline 29}

{com}. table year racecat, c(mean los_w)

{txt}{hline 10}{c TT}{hline 29}
          {c |}  Indicates race: white (1)  
Discharge {c |}    black (2) or other (3)   
year      {c |}        1         2         3
{hline 10}{c +}{hline 29}
     2009 {c |} {res}4.511111  5.223077  4.555555
     {txt}2010 {c |} {res}4.699526  5.145814  4.832554
     {txt}2011 {c |}   {res}4.7444  5.062831  4.667514
     {txt}2012 {c |} {res}4.635095  5.195254  4.834656
     {txt}2013 {c |} {res}4.823622  5.274227  4.755707
     {txt}2014 {c |} {res}5.001951  5.692456  4.950678
     {txt}2015 {c |} {res}5.150054   5.60799  5.105669
     {txt}2016 {c |} {res}5.166096  5.601535  5.185231
     {txt}2017 {c |} {res}4.957378  5.279867  5.150685
     {txt}2018 {c |} {res}4.934576  5.247185  4.986344
{txt}{hline 10}{c BT}{hline 29}

{com}. table year racecat, c(mean postcare)

{txt}{hline 10}{c TT}{hline 29}
          {c |}  Indicates race: white (1)  
Discharge {c |}    black (2) or other (3)   
year      {c |}        1         2         3
{hline 10}{c +}{hline 29}
     2009 {c |} {res}.4962963  .4153846  .3888889
     {txt}2010 {c |} {res}.4412801  .4210054  .4294392
     {txt}2011 {c |} {res}.4476208  .4101592  .4204497
     {txt}2012 {c |} {res}.4268883  .4364378  .3826851
     {txt}2013 {c |} {res}.4239197  .4001378  .3901165
     {txt}2014 {c |} {res}.3776047  .3853152  .3439569
     {txt}2015 {c |} {res}.3534608  .3550221  .3269903
     {txt}2016 {c |}  {res}.376649  .3760331  .3610771
     {txt}2017 {c |} {res}.4096102  .4076327  .3772994
     {txt}2018 {c |} {res}.4405234  .4273649  .3944596
{txt}{hline 10}{c BT}{hline 29}

{com}. table year insurance, c(mean totchg_w)

{txt}{hline 10}{c TT}{hline 29}
          {c |}    Insurance categorical    
Discharge {c |}           variable          
year      {c |}        1         2         3
{hline 10}{c +}{hline 29}
     2009 {c |}        {res}0         0         0
     {txt}2010 {c |}  {res}88707.8  83902.31  92206.45
     {txt}2011 {c |} {res}91304.13  80173.63  90881.34
     {txt}2012 {c |} {res}91832.66  83480.49  93694.05
     {txt}2013 {c |} {res}96310.49  85472.96  93585.43
     {txt}2014 {c |} {res}95418.61  87107.14  89897.05
     {txt}2015 {c |} {res}98390.72  90327.05  93995.17
     {txt}2016 {c |} {res}102229.7  98162.86  96113.71
     {txt}2017 {c |} {res}105433.7  94690.06  98185.91
     {txt}2018 {c |}        {res}0         0         0
{txt}{hline 10}{c BT}{hline 29}

{com}. table year insurance, c(mean los_w)

{txt}{hline 10}{c TT}{hline 29}
          {c |}    Insurance categorical    
Discharge {c |}           variable          
year      {c |}        1         2         3
{hline 10}{c +}{hline 29}
     2009 {c |} {res}4.875342  5.864407  4.041588
     {txt}2010 {c |} {res}5.114615  6.032353  3.784319
     {txt}2011 {c |} {res}5.152964  5.782828  3.600202
     {txt}2012 {c |} {res}5.069235  5.796129  3.548954
     {txt}2013 {c |} {res}5.222955  5.674541  3.654441
     {txt}2014 {c |} {res}5.417676  5.552359  3.895205
     {txt}2015 {c |} {res}5.579911  5.521791  3.953168
     {txt}2016 {c |} {res}5.609796  5.686059  3.951329
     {txt}2017 {c |} {res}5.388131   5.35692  3.845998
     {txt}2018 {c |} {res}5.275734  5.298315  3.924479
{txt}{hline 10}{c BT}{hline 29}

{com}. table year insurance, c(mean postcare)

{txt}{hline 10}{c TT}{hline 29}
          {c |}    Insurance categorical    
Discharge {c |}           variable          
year      {c |}        1         2         3
{hline 10}{c +}{hline 29}
     2009 {c |} {res}.5246575  .1694915  .4517958
     {txt}2010 {c |} {res}.5134023  .2913616  .3015992
     {txt}2011 {c |} {res}.5178553  .2449495  .2882383
     {txt}2012 {c |} {res}.4862749  .2473958  .2759959
     {txt}2013 {c |} {res}.4837058  .2615588  .2563699
     {txt}2014 {c |} {res}.4448658  .2467986  .1904212
     {txt}2015 {c |} {res}.4188394  .2102748  .1741667
     {txt}2016 {c |} {res}.4481858  .2447859  .1888977
     {txt}2017 {c |} {res}.4882577   .264308  .1881966
     {txt}2018 {c |} {res}.5088456  .2923687  .2233958
{txt}{hline 10}{c BT}{hline 29}

{com}. table year agecat, c(mean totchg_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Age categorical  
Discharge {c |}      variable     
year      {c |}        3         4
{hline 10}{c +}{hline 19}
     2009 {c |}        {res}0         0
     {txt}2010 {c |} {res}90995.83   88707.8
     {txt}2011 {c |} {res}89099.35  91304.13
     {txt}2012 {c |} {res}91990.33  91832.66
     {txt}2013 {c |} {res}92235.42  96310.49
     {txt}2014 {c |} {res}89339.96  95418.61
     {txt}2015 {c |} {res}93299.88  98390.72
     {txt}2016 {c |} {res}96509.88  102229.7
     {txt}2017 {c |} {res}97501.55  105433.7
     {txt}2018 {c |}        {res}0         0
{txt}{hline 10}{c BT}{hline 19}

{com}. table year agecat, c(mean los_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Age categorical  
Discharge {c |}      variable     
year      {c |}        3         4
{hline 10}{c +}{hline 19}
     2009 {c |}  {res}4.22449  4.875342
     {txt}2010 {c |} {res}4.111516  5.114615
     {txt}2011 {c |} {res}3.963438  5.152964
     {txt}2012 {c |} {res}3.923805  5.069235
     {txt}2013 {c |} {res}3.990609  5.222955
     {txt}2014 {c |} {res}4.226103  5.417676
     {txt}2015 {c |} {res}4.250502  5.579911
     {txt}2016 {c |} {res}4.286715  5.609796
     {txt}2017 {c |}  {res}4.14178  5.388131
     {txt}2018 {c |} {res}4.213511  5.275734
{txt}{hline 10}{c BT}{hline 19}

{com}. table year agecat, c(mean postcare)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Age categorical  
Discharge {c |}      variable     
year      {c |}        3         4
{hline 10}{c +}{hline 19}
     2009 {c |} {res}.4234694  .5246575
     {txt}2010 {c |} {res}.3001067  .5134023
     {txt}2011 {c |} {res}.2810265  .5178553
     {txt}2012 {c |} {res}.2712559  .4862749
     {txt}2013 {c |} {res}.2572305  .4837058
     {txt}2014 {c |} {res}.2016185  .4448658
     {txt}2015 {c |} {res}.1809781  .4188394
     {txt}2016 {c |} {res}.1997029  .4481858
     {txt}2017 {c |} {res}.2030964  .4882577
     {txt}2018 {c |} {res}.2379066  .5088456
{txt}{hline 10}{c BT}{hline 19}

{com}. 
. table year medicare, c(mean teach)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |} {res}.4336735  .3438356
     {txt}2010 {c |}  {res}.315048   .223842
     {txt}2011 {c |} {res}.3370456  .2224747
     {txt}2012 {c |} {res}.4042187  .3546534
     {txt}2013 {c |} {res}.3924438  .3354072
     {txt}2014 {c |} {res}.3520221  .3147721
     {txt}2015 {c |} {res}.3536504  .3115982
     {txt}2016 {c |} {res}.3357385  .3166472
     {txt}2017 {c |} {res}.3742106    .32234
     {txt}2018 {c |} {res}.3246455  .2868428
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare, c(mean snf_)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |}        {res}0         0
     {txt}2010 {c |} {res}.2260406  .2213732
     {txt}2011 {c |} {res}.2532045  .2255732
     {txt}2012 {c |} {res}.2628067  .2143934
     {txt}2013 {c |} {res}.1941472  .1420745
     {txt}2014 {c |} {res}.1245404  .0623197
     {txt}2015 {c |} {res}.1236883  .0619682
     {txt}2016 {c |} {res}.1078098  .0628433
     {txt}2017 {c |} {res}.1411693  .0832556
     {txt}2018 {c |} {res}.0763136  .0308566
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare, c(mean rehab_)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |} {res}.1462585  .2013699
     {txt}2010 {c |}  {res}.549413  .5300964
     {txt}2011 {c |} {res}.6219794  .5750878
     {txt}2012 {c |} {res}.5215239   .465147
     {txt}2013 {c |} {res}.5070976  .4483239
     {txt}2014 {c |} {res}.4963235  .4717253
     {txt}2015 {c |} {res}.5119447  .4900111
     {txt}2016 {c |} {res}.5091256  .4932025
     {txt}2017 {c |}  {res}.527195  .5053836
     {txt}2018 {c |} {res}.4841534  .4662223
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare, c(mean ltc_)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |}        {res}0         0
     {txt}2010 {c |}        {res}0         0
     {txt}2011 {c |} {res}.0283673  .0394547
     {txt}2012 {c |} {res}.0695222  .0732856
     {txt}2013 {c |} {res}.0722865  .0717801
     {txt}2014 {c |} {res}.0712316  .0789575
     {txt}2015 {c |} {res}.0346059  .0418979
     {txt}2016 {c |}        {res}0         0
     {txt}2017 {c |}        {res}0         0
     {txt}2018 {c |}        {res}0         0
{txt}{hline 10}{c BT}{hline 19}

{com}. 
. table year medicare if inlist(drg, 469, 470), c(mean totchg_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |}        {res}0         0
     {txt}2010 {c |} {res}127580.1  118660.9
     {txt}2011 {c |} {res}123941.5  124369.1
     {txt}2012 {c |} {res}133928.4    135128
     {txt}2013 {c |} {res}127583.3  133317.1
     {txt}2014 {c |} {res}111150.7  120874.5
     {txt}2015 {c |} {res}115519.7  121497.5
     {txt}2016 {c |} {res}122888.4  128703.1
     {txt}2017 {c |} {res}118552.7  122905.2
     {txt}2018 {c |}        {res}0         0
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare if inlist(drg, 391, 392), c(mean totchg_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2010 {c |} {res}42720.67  55950.57
     {txt}2011 {c |} {res}45051.29  59264.21
     {txt}2012 {c |} {res}38850.32  53841.12
     {txt}2013 {c |} {res}48234.56  63978.72
     {txt}2014 {c |} {res}47288.23  58291.14
     {txt}2015 {c |} {res}46645.32  53729.15
     {txt}2016 {c |} {res}52489.61  60892.62
     {txt}2017 {c |} {res}51109.31   63926.2
     {txt}2018 {c |}        {res}0         0
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare if inlist(drg, 870, 871, 872), c(mean totchg_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |}        {res}0         0
     {txt}2010 {c |} {res}136576.5  119320.2
     {txt}2011 {c |} {res}128585.4    128846
     {txt}2012 {c |} {res}134481.3    136607
     {txt}2013 {c |} {res}143160.3  147251.9
     {txt}2014 {c |} {res}139189.2  145504.9
     {txt}2015 {c |} {res}122953.7  144480.2
     {txt}2016 {c |} {res}125897.4  139678.3
     {txt}2017 {c |} {res}109771.3    134426
     {txt}2018 {c |}        {res}0         0
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare if inlist(drg, 469, 470), c(mean los_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |} {res}3.231818  3.765363
     {txt}2010 {c |} {res}3.090713  3.782766
     {txt}2011 {c |}  {res}3.01567  3.662785
     {txt}2012 {c |} {res}2.808379  3.580451
     {txt}2013 {c |} {res}2.515523  3.408999
     {txt}2014 {c |} {res}2.544166  3.342088
     {txt}2015 {c |} {res}2.328753  3.271244
     {txt}2016 {c |} {res}2.179184  3.176166
     {txt}2017 {c |}  {res}2.02089  2.886792
     {txt}2018 {c |}  {res}2.09542  3.403677
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare if inlist(drg, 391, 392), c(mean los_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2010 {c |}     {res}2.75  3.822581
     {txt}2011 {c |} {res}2.963964   4.28972
     {txt}2012 {c |}  {res}3.00885  3.967742
     {txt}2013 {c |} {res}3.355263  4.543478
     {txt}2014 {c |} {res}3.139344  3.888889
     {txt}2015 {c |} {res}3.276786  3.484375
     {txt}2016 {c |} {res}3.209091  3.506849
     {txt}2017 {c |} {res}3.095745  3.709677
     {txt}2018 {c |} {res}2.935897   3.03937
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare if inlist(drg, 870, 871, 872), c(mean los_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |}        {res}9  7.268293
     {txt}2010 {c |} {res}8.421296  7.158133
     {txt}2011 {c |}        {res}8  7.948229
     {txt}2012 {c |} {res}7.619433  8.221957
     {txt}2013 {c |}     {res}7.95  8.588298
     {txt}2014 {c |} {res}7.888889  8.440633
     {txt}2015 {c |} {res}7.231626  8.627214
     {txt}2016 {c |}  {res}7.13035  8.244415
     {txt}2017 {c |} {res}6.234437   7.66483
     {txt}2018 {c |} {res}6.101775  6.997793
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare if inlist(drg, 469, 470), c(mean postcare)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |} {res}.8681818  .8044693
     {txt}2010 {c |} {res}.6450684  .7812178
     {txt}2011 {c |} {res}.6336422  .8125633
     {txt}2012 {c |} {res}.6281056  .7854636
     {txt}2013 {c |} {res}.5503685  .7446808
     {txt}2014 {c |} {res}.3777533  .6527967
     {txt}2015 {c |} {res}.3344017  .6109965
     {txt}2016 {c |} {res}.3154506  .5880829
     {txt}2017 {c |} {res}.2960944  .5504043
     {txt}2018 {c |} {res}.4058524  .6842526
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare if inlist(drg, 391, 392), c(mean postcare)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2010 {c |} {res}.0217391  .2258064
     {txt}2011 {c |}  {res}.027027  .2429907
     {txt}2012 {c |} {res}.0088496  .2258064
     {txt}2013 {c |} {res}.0263158  .2527473
     {txt}2014 {c |} {res}.0491803  .2142857
     {txt}2015 {c |}    {res}.0625   .140625
     {txt}2016 {c |} {res}.0181818  .1986301
     {txt}2017 {c |} {res}.0106383  .2580645
     {txt}2018 {c |} {res}.0384615  .1811024
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare if inlist(drg, 870, 871, 872), c(mean postcare)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |} {res}.2352941  .5365854
     {txt}2010 {c |} {res}.4212963  .5873494
     {txt}2011 {c |} {res}.3482143  .6147541
     {txt}2012 {c |} {res}.3441296  .5859188
     {txt}2013 {c |} {res}.3299663  .5747863
     {txt}2014 {c |} {res}.3242507  .5346975
     {txt}2015 {c |} {res}.2488585  .5195936
     {txt}2016 {c |} {res}.2840467   .543364
     {txt}2017 {c |} {res}.2317881  .5686373
     {txt}2018 {c |} {res}.2816568  .5527594
{txt}{hline 10}{c BT}{hline 19}

{com}. 
. 
. **look at facility characteristics
. 
. table bpci, c(m  icu m urban m income m bedsize m hcontr)

{txt}{hline 10}{c TT}{hline 69}
Indicates {c |}
episode   {c |}
covered   {c |}
by BPCI   {c |}    mean(icu)   mean(urban)  mean(income)  mean(beds~e)  mean(hcon~l)
{hline 10}{c +}{hline 69}
        1 {c |}     {res}.3747672       2.86453       3.11476      2.825415      1.000029
{txt}{hline 10}{c BT}{hline 69}

{com}. 
. *Parallel trends means: Medicare 65+ vs Private/Medicaid 45-64
. table year medicare, c(mean totchg_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |}        {res}0         0
     {txt}2010 {c |} {res}90995.83   88707.8
     {txt}2011 {c |} {res}89099.35  91304.13
     {txt}2012 {c |} {res}91990.33  91832.66
     {txt}2013 {c |} {res}92235.42  96310.49
     {txt}2014 {c |} {res}89339.96  95418.61
     {txt}2015 {c |} {res}93299.88  98390.72
     {txt}2016 {c |} {res}96509.88  102229.7
     {txt}2017 {c |} {res}97501.55  105433.7
     {txt}2018 {c |}        {res}0         0
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare, c(mean los_w)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |}  {res}4.22449  4.875342
     {txt}2010 {c |} {res}4.111516  5.114615
     {txt}2011 {c |} {res}3.963438  5.152964
     {txt}2012 {c |} {res}3.923805  5.069235
     {txt}2013 {c |} {res}3.990609  5.222955
     {txt}2014 {c |} {res}4.226103  5.417676
     {txt}2015 {c |} {res}4.250502  5.579911
     {txt}2016 {c |} {res}4.286715  5.609796
     {txt}2017 {c |}  {res}4.14178  5.388131
     {txt}2018 {c |} {res}4.213511  5.275734
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare, c(mean postcare)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |} {res}.4234694  .5246575
     {txt}2010 {c |} {res}.3001067  .5134023
     {txt}2011 {c |} {res}.2810265  .5178553
     {txt}2012 {c |} {res}.2712559  .4862749
     {txt}2013 {c |} {res}.2572305  .4837058
     {txt}2014 {c |} {res}.2016185  .4448658
     {txt}2015 {c |} {res}.1809781  .4188394
     {txt}2016 {c |} {res}.1997029  .4481858
     {txt}2017 {c |} {res}.2030964  .4882577
     {txt}2018 {c |} {res}.2379066  .5088456
{txt}{hline 10}{c BT}{hline 19}

{com}. 
. table year medicare, c(mean totchg_r)

{txt}{hline 10}{c TT}{hline 19}
          {c |}  Primary expected 
Discharge {c |} payer is medicare 
year      {c |}        0         1
{hline 10}{c +}{hline 19}
     2009 {c |}        {res}0         0
     {txt}2010 {c |} {res}92235.18  89816.34
     {txt}2011 {c |} {res}90568.24  92697.77
     {txt}2012 {c |} {res}93254.58  93118.55
     {txt}2013 {c |}  {res}93591.4  98884.92
     {txt}2014 {c |} {res}91705.38  97770.32
     {txt}2015 {c |} {res}95247.71    100657
     {txt}2016 {c |} {res}98755.09  104688.9
     {txt}2017 {c |} {res}99097.01  107545.1
     {txt}2018 {c |}        {res}0         0
{txt}{hline 10}{c BT}{hline 19}

{com}. table year medicare, c(mean los_r)

{txt}{hline 10}{c TT}{hline 17}
          {c |} Primary expected
Discharge {c |}payer is medicare
year      {c |}       0        1
{hline 10}{c +}{hline 17}
     2009 {c |} {res}4.22959  5.01918
     {txt}2010 {c |} {res}4.12757  5.12262
     {txt}2011 {c |} {res}3.98886  5.15844
     {txt}2012 {c |} {res}3.92596    5.078
     {txt}2013 {c |} {res}4.00328  5.26038
     {txt}2014 {c |} {res}4.25988  5.43653
     {txt}2015 {c |} {res}4.29873  5.59887
     {txt}2016 {c |} {res}4.38391  5.62348
     {txt}2017 {c |} {res}4.16154   5.4056
     {txt}2018 {c |} {res}4.22206  5.29334
{txt}{hline 10}{c BT}{hline 17}

{com}. 
. 
. **REGRESSIONS**
. //stratified for snf, rehab, ltc, and teaching hospitals
. //stratified for 3 most common BPCI drgs: Major Joint Replacement, Esophagitis, gastroenteritis and other digestive disorders, Sepsis 
. //stratified for race and ethnicity
. 
. //total charges
. reg totchg_r medicare post did, vce(cluster thcic_id)
{txt}note: post omitted because of collinearity
note: did omitted because of collinearity

Linear regression                               Number of obs     = {res}    61,473
                                                {txt}F(1, 9)           =  {res}     3.42
                                                {txt}Prob > F          = {res}    0.0976
                                                {txt}R-squared         = {res}    0.0005
                                                {txt}Root MSE          =    {res}  90136

{txt}{ralign 78:(Std. Err. adjusted for {res:10} clusters in thcic_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    totchg_r{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}medicare {c |}{col 14}{res}{space 2} 4319.732{col 26}{space 2} 2337.321{col 37}{space 1}    1.85{col 46}{space 3}0.098{col 54}{space 4} -967.656{col 67}{space 3}  9607.12
{txt}{space 8}post {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}did {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} 72640.75{col 26}{space 2} 3998.858{col 37}{space 1}   18.17{col 46}{space 3}0.000{col 54}{space 4} 63594.71{col 67}{space 3}  81686.8
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg totchg_w medicare post did, vce(cluster thcic_id)
{txt}note: post omitted because of collinearity
note: did omitted because of collinearity

Linear regression                               Number of obs     = {res}    61,473
                                                {txt}F(1, 9)           =  {res}     4.06
                                                {txt}Prob > F          = {res}    0.0747
                                                {txt}R-squared         = {res}    0.0006
                                                {txt}Root MSE          =    {res}  79456

{txt}{ralign 78:(Std. Err. adjusted for {res:10} clusters in thcic_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    totchg_w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}medicare {c |}{col 14}{res}{space 2} 4126.623{col 26}{space 2} 2047.894{col 37}{space 1}    2.02{col 46}{space 3}0.075{col 54}{space 4}-506.0361{col 67}{space 3} 8759.282
{txt}{space 8}post {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}did {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} 71164.94{col 26}{space 2}  3868.08{col 37}{space 1}   18.40{col 46}{space 3}0.000{col 54}{space 4} 62414.74{col 67}{space 3} 79915.14
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg totchg_rlog medicare post did, vce(cluster thcic_id)
{txt}note: post omitted because of collinearity
note: did omitted because of collinearity

Linear regression                               Number of obs     = {res}    45,344
                                                {txt}F(1, 9)           =  {res}     6.06
                                                {txt}Prob > F          = {res}    0.0360
                                                {txt}R-squared         = {res}    0.0024
                                                {txt}Root MSE          =    {res} .73772

{txt}{ralign 78:(Std. Err. adjusted for {res:10} clusters in thcic_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} totchg_rlog{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}medicare {c |}{col 14}{res}{space 2}  .080224{col 26}{space 2} .0325753{col 37}{space 1}    2.46{col 46}{space 3}0.036{col 54}{space 4} .0065334{col 67}{space 3} .1539145
{txt}{space 8}post {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}did {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} 11.21543{col 26}{space 2} .0564627{col 37}{space 1}  198.63{col 46}{space 3}0.000{col 54}{space 4}  11.0877{col 67}{space 3} 11.34316
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg totchg_r medicare post did female highsev dual icu ethnicity i.racecat i.urban i.income i.bedsize i.hcontrl i.year, vce(cluster thcic_id)
{err}year:  string variables may not be used as factor variables
{txt}{search r(109), local:r(109);}

end of do-file

{search r(109), local:r(109);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/austinbean/Google Drive/Texas PUDF Zipped Backup Files/other_analyses/DiRienz//BPCI_analysis.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 9 Apr 2021, 20:49:34
{txt}{.-}
{smcl}
{txt}{sf}{ul off}